In [1]:
## CUSTOMER SEGMENTATION PROCESS (RULE BASED CLASSIFICATION) ##

In [2]:
# Customer segmentation is the process of dividing customers with similar characteristics, needs, and behaviors into groups, 
# and creating marketing strategies specific to these groups.

# The purpose of segmentation is to determine which segment new customers are in, 
# to support marketing strategies, and to calculate the average return expectations of these customers.

In [3]:
# Business Problem #

# A gaming company aims to create new level-based customer definitions (personas) based on customer characteristics,
# and segment customers based on these definitions.

# They want to estimate the average revenue return for the company from potential new customers based on these segments.

# For example the average return for a 25-year-old male user from Turkey who uses IOS is aimed to be determined.

In [4]:
# Dataset Story #

# The Persona.csv dataset contains prices for products from an international gaming company and some demographic information about users who purchased these products.
# The dataset contains one record for each sales transaction, meaning the table is not deduplicated.
# This means that a user with certain demographics may have made multiple purchases.

# Price: Amount spent by the customer
# Source: Type of device used by the customer
# Sex: Gender of the customer
# Country: Country of the customer
# Age: Age of the customer

In [5]:
# Project Stages #

# Review and understand the dataset.
# Data manipulation.
# Creating segments according to customer definitions (Segmentation process).
# Making an average income estimate for each segment.
# Classifying new customers according to the results and estimating how much income they can bring.

# 1) Grouping the data frame according to COUNTRY, SOURCE, SEX, AGE, and seeing average prices.
# 2) Creating a new age category column named AGE_CAT
# 3) Creating a new persona definition column named CUSTOMERS_LEVEL_BASED (e.g. FRA_ANDROID_FEMALE_24_30)
# 4) Creating a new SEGMENT column according to price averages (with A, B, C, D segments)
# 5) Determining segments for new/potential customers and making income estimates.

In [6]:
## Project Steps ##

In [7]:
# 1) Importing the libraries, persona.csv file and displaying general information about the data set.

In [8]:
import pandas as pd
import seaborn as sns

In [9]:
pd.set_option("display.max_columns", None)  
pd.set_option("display.width", 500)         
pd.set_option("display.precision", 2)

In [10]:
df = pd.read_csv('persona.csv')

In [11]:
# Functional Data Exploration

def explore_dataframe(dataframe, head=5):
    print("###################### First 5 Rows ######################")
    print(dataframe.head(head))
    print("###################### Last 5 Rows ######################")
    print(dataframe.tail(head))
    print("###################### Shape: Rows x Columns ######################")
    print(dataframe.shape)
    print("###################### General Info ######################")
    print(dataframe.info())
    print("###################### Null Values ######################")
    print(dataframe.isnull().sum().sort_values(ascending=False))
    print("###################### Statistical Info ######################")
    print(dataframe.describe().T)

In [12]:
explore_dataframe(df)

###################### First 5 Rows ######################
   PRICE   SOURCE   SEX COUNTRY  AGE
0     39  android  male     bra   17
1     39  android  male     bra   17
2     49  android  male     bra   17
3     29  android  male     tur   17
4     49  android  male     tur   17
###################### Last 5 Rows ######################
      PRICE   SOURCE     SEX COUNTRY  AGE
4995     29  android  female     bra   31
4996     29  android  female     bra   31
4997     29  android  female     bra   31
4998     39  android  female     bra   31
4999     29  android  female     bra   31
###################### Shape: Rows x Columns ######################
(5000, 5)
###################### General Info ######################
<class 'pandas.core.frame.DataFrame'>
Index: 5000 entries, 0 to 4999
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   PRICE    5000 non-null   int64
 1   SOURCE   5000 non-null   object
 2   SEX      5000 non-null   object
 3   COUNTRY  5000 non-null   object
 4   AGE      5000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 234.4+ KB
None
###################### Null Values ######################
PRICE      0
SOURCE     0
SEX        0
COUNTRY    0
AGE        0
dtype: int64
###################### Statistical Info ######################
        count   mean    std   min   25%   50%   75%   max
PRICE  5000.0  34.13  12.46   9.0  29.0  39.0  39.0  59.0
AGE    5000.0  23.58   9.00  15.0  17.0  21.0  27.0  66.0

In [13]:
df.sample(5)

      PRICE   SOURCE     SEX COUNTRY  AGE
2536     29  android    male     usa   41
4431     29      ios    male     bra   44
2813     19      ios  female     bra   24
2758     39      ios  female     deu   16
3283     29  android    male     usa   22

In [14]:
# Unique SORUCES and value counts.

In [15]:
df["SOURCE"].unique()

array(['android', 'ios'], dtype=object)

In [16]:
df["SOURCE"].nunique()

2

In [17]:
df["SOURCE"].value_counts()

SOURCE
android    2974
ios        2026
Name: count, dtype: int64

In [18]:
# Unique PRICES

In [19]:
df["PRICE"].unique()

array([39, 49, 29, 19, 59,  9], dtype=int64)

In [20]:
df["PRICE"].nunique()

6

In [21]:
# Sales made based on PRICES

In [22]:
df["PRICE"].value_counts()

PRICE
29    1305
39    1260
49    1031
19     992
59     212
9      200
Name: count, dtype: int64

In [23]:
df.groupby("PRICE").agg({"PRICE": "count"})

       PRICE
PRICE
9        200
19       992
29      1305
39      1260
49      1031
59       212

In [24]:
# Sales by COUNTRY

In [25]:
df["COUNTRY"].value_counts()

COUNTRY
usa    2065
bra    1496
deu     455
tur     451
fra     303
can     230
Name: count, dtype: int64

In [26]:
df.groupby("COUNTRY").agg({"COUNTRY": "count"})

         COUNTRY
COUNTRY
bra         1496
can          230
deu          455
fra          303
tur          451
usa         2065

In [27]:
# Total revenue from sales by COUNTRY

In [28]:
df.groupby("COUNTRY").agg({"PRICE": "sum"})

         PRICE
COUNTRY
bra      51354
can       7730
deu      15485
fra      10177
tur      15689
usa      70225

In [29]:
df.groupby("COUNTRY").agg({"PRICE": "sum"}).sort_values(by="PRICE", ascending=False)

         PRICE
COUNTRY
usa      70225
bra      51354
tur      15689
deu      15485
fra      10177
can       7730

In [30]:
# Sales by SOURCE type

In [31]:
df["SOURCE"].value_counts()

SOURCE
android    2974
ios        2026
Name: count, dtype: int64

In [32]:
df.groupby("SOURCE").agg({"SOURCE": "count"})

         SOURCE
SOURCE
android    2974
ios        2026

In [33]:
# PRICE averages by COUNTRY

In [34]:
df.groupby("COUNTRY").agg({"PRICE": "mean"})

         PRICE
COUNTRY
bra      34.33
can      33.61
deu      34.03
fra      33.59
tur      34.79
usa      34.01

In [35]:
df.groupby("COUNTRY").agg({"PRICE": "mean"}).sort_values(by="PRICE", ascending=False)

         PRICE
COUNTRY
tur      34.79
bra      34.33
deu      34.03
usa      34.01
can      33.61
fra      33.59

In [ ]:
# PRICE averages by SOURCE

In [36]:
df.groupby("SOURCE").agg({"PRICE": "mean"})

         PRICE
SOURCE
android  34.17
ios      34.07

In [ ]:
# PRICE averages by COUNTRY-SOURCE

In [37]:
df.groupby(["COUNTRY", "SOURCE"]).agg({"PRICE": "mean"})

                 PRICE
COUNTRY SOURCE
bra     android  34.39
        ios      34.22
can     android  33.33
        ios      33.95
deu     android  33.87
        ios      34.27
fra     android  34.31
        ios      32.78
tur     android  36.23
        ios      33.27
usa     android  33.76
        ios      34.37

In [ ]:
# Average earnings by COUNTRY, SORUCE, SEX, AGE

In [38]:
df.groupby(["COUNTRY", "SOURCE", "SEX", "AGE"]).agg({"PRICE": "mean"})

                            PRICE
COUNTRY SOURCE  SEX    AGE
bra     android female 15   38.71
                       16   35.94
                       17   35.67
                       18   32.26
                       19   35.21
...                           ...
usa     ios     male   42   30.25
                       50   39.00
                       53   34.00
                       55   29.00
                       59   46.50

[348 rows x 1 columns]

In [ ]:
# Sorting by PRICE

In [41]:
agg_df = df.groupby(["COUNTRY", "SOURCE", "SEX", "AGE"]).agg({"PRICE": "mean"}).sort_values(by="PRICE", ascending=False)

agg_df

                            PRICE
COUNTRY SOURCE  SEX    AGE
bra     android male   46    59.0
usa     android male   36    59.0
fra     android female 24    59.0
usa     ios     male   32    54.0
deu     android female 36    49.0
...                           ...
usa     ios     female 38    19.0
                       30    19.0
can     android female 27    19.0
fra     android male   18    19.0
deu     android male   26     9.0

[348 rows x 1 columns]

In [ ]:
# 2) Converting the index names into variable names.

In [42]:
agg_df.reset_index(inplace=True)

In [43]:
agg_df

    COUNTRY   SOURCE     SEX  AGE  PRICE
0       bra  android    male   46   59.0
1       usa  android    male   36   59.0
2       fra  android  female   24   59.0
3       usa      ios    male   32   54.0
4       deu  android  female   36   49.0
..      ...      ...     ...  ...    ...
343     usa      ios  female   38   19.0
344     usa      ios  female   30   19.0
345     can  android  female   27   19.0
346     fra  android    male   18   19.0
347     deu  android    male   26    9.0

[348 rows x 5 columns]

In [ ]:
# Converting the numeric variable "AGE" to a categorical variable.

In [44]:
agg_df["AGE"].dtype

dtype('int64')

In [45]:
agg_df["AGE"] = agg_df["AGE"].astype("category")

In [46]:
agg_df["AGE"].dtype

CategoricalDtype(categories=[15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 49, 50, 51, 52, 53, 54, 55, 56, 57, 59, 61, 65, 66], ordered=False, categories_dtype=int64)

In [50]:
agg_df["AGE_CAT"] = agg_df["AGE"].apply(
lambda x: '0_18' 
    if x <= 18 
       else'19_23' 
    if x <= 23 
       else'24_30'
    if x <= 30 
       else'31_40' 
    if x <= 40 
       else '41_70')

In [51]:
agg_df.sample(10)

    COUNTRY   SOURCE     SEX AGE  PRICE AGE_CAT
292     bra  android    male  53  29.00   41_70
173     usa      ios    male  20  34.00   19_23
271     deu      ios  female  15  30.67    0_18
309     usa  android    male  37  29.00   31_40
1       usa  android    male  36  59.00   31_40
272     fra      ios    male  16  30.67    0_18
139     deu      ios    male  17  35.00    0_18
59      tur  android    male  17  39.00    0_18
264     deu  android  female  21  31.00   19_23
112     bra  android  female  25  35.67   24_30

In [ ]:
# 3) Defining a variable named CUSTOMERS_LEVEL_BASED and adding this variable to the data set.

In [108]:
agg_df["CUSTOMERS_LEVEL_BASED"] = agg_df["COUNTRY"] + "_" + agg_df["SOURCE"] + "_" + agg_df["SEX"] + "_" + agg_df["AGE_CAT"]

In [119]:
agg_df["CUSTOMERS_LEVEL_BASED"] = agg_df["CUSTOMERS_LEVEL_BASED"].str.upper()

In [120]:
agg_df

    COUNTRY   SOURCE     SEX AGE  PRICE AGE_CAT SEGMENT     CUSTOMERS_LEVEL_BASED
0       bra  android    male  46   59.0   41_70       A    BRA_ANDROID_MALE_41_70
1       usa  android    male  36   59.0   31_40       A    USA_ANDROID_MALE_31_40
2       fra  android  female  24   59.0   24_30       A  FRA_ANDROID_FEMALE_24_30
3       usa      ios    male  32   54.0   31_40       A        USA_IOS_MALE_31_40
4       deu  android  female  36   49.0   31_40       A  DEU_ANDROID_FEMALE_31_40
..      ...      ...     ...  ..    ...     ...     ...                       ...
343     usa      ios  female  38   19.0   31_40       D      USA_IOS_FEMALE_31_40
344     usa      ios  female  30   19.0   24_30       D      USA_IOS_FEMALE_24_30
345     can  android  female  27   19.0   24_30       D  CAN_ANDROID_FEMALE_24_30
346     fra  android    male  18   19.0    0_18       D     FRA_ANDROID_MALE_0_18
347     deu  android    male  26    9.0   24_30       D    DEU_ANDROID_MALE_24_30

[348 rows x 8 columns]

In [ ]:
# Filtering PRICE and CUSTOMERS_LEVEL_BASED

In [121]:
agg_df.loc[:, ["CUSTOMERS_LEVEL_BASED", "PRICE"]]

        CUSTOMERS_LEVEL_BASED  PRICE
0      BRA_ANDROID_MALE_41_70   59.0
1      USA_ANDROID_MALE_31_40   59.0
2    FRA_ANDROID_FEMALE_24_30   59.0
3          USA_IOS_MALE_31_40   54.0
4    DEU_ANDROID_FEMALE_31_40   49.0
..                        ...    ...
343      USA_IOS_FEMALE_31_40   19.0
344      USA_IOS_FEMALE_24_30   19.0
345  CAN_ANDROID_FEMALE_24_30   19.0
346     FRA_ANDROID_MALE_0_18   19.0
347    DEU_ANDROID_MALE_24_30    9.0

[348 rows x 2 columns]

In [ ]:
# PPRICE averages of CUSTOMERS_LEVEL_BASED

In [122]:
agg_df.groupby("CUSTOMERS_LEVEL_BASED").agg({"PRICE": "mean"}).sort_values(by = "PRICE", ascending = False)

                          PRICE
CUSTOMERS_LEVEL_BASED
FRA_ANDROID_FEMALE_24_30  45.43
TUR_IOS_MALE_24_30        45.00
TUR_IOS_MALE_31_40        42.33
TUR_ANDROID_FEMALE_31_40  41.83
CAN_ANDROID_MALE_19_23    40.11
...                         ...
TUR_IOS_MALE_41_70        25.05
TUR_IOS_MALE_19_23        24.83
FRA_ANDROID_MALE_0_18     24.62
CAN_ANDROID_FEMALE_24_30  19.00
DEU_ANDROID_MALE_24_30    19.00

[109 rows x 1 columns]

In [ ]:
# 4) Dividing customers into 4 segments based on PRICE, using the CUSTOMERS_LEVEL_BASED column.

In [123]:
agg_df.sample(10)

    COUNTRY   SOURCE     SEX AGE  PRICE AGE_CAT SEGMENT     CUSTOMERS_LEVEL_BASED
308     usa  android    male  34  29.00   31_40       D    USA_ANDROID_MALE_31_40
311     usa  android  female  30  29.00   24_30       D  USA_ANDROID_FEMALE_24_30
220     usa  android  female  15  32.67    0_18       C   USA_ANDROID_FEMALE_0_18
73      can      ios    male  15  37.57    0_18       A         CAN_IOS_MALE_0_18
130     usa  android    male  18  35.19    0_18       B     USA_ANDROID_MALE_0_18
178     deu      ios  female  22  34.00   19_23       C      DEU_IOS_FEMALE_19_23
78      tur      ios  female  20  37.33   19_23       A      TUR_IOS_FEMALE_19_23
229     usa  android    male  21  32.33   19_23       C    USA_ANDROID_MALE_19_23
135     usa  android  female  31  35.00   31_40       B  USA_ANDROID_FEMALE_31_40
16      bra  android  female  43  44.00   41_70       A  BRA_ANDROID_FEMALE_41_70

In [90]:
agg_df["SEGMENT"] = pd.qcut(agg_df["PRICE"], q = 4, labels = ["D", "C", "B", "A"])

In [112]:
agg_df.groupby("SEGMENT").agg({"PRICE": ["mean", "sum", "min", "max", "count"]})

C:\Users\Excalibur\AppData\Local\Temp\ipykernel_34436\1166462556.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  agg_df.groupby("SEGMENT").agg({"PRICE": ["mean", "sum", "min", "max", "count"]})

         PRICE
          mean      sum    min    max count
SEGMENT
D        27.30  2375.33   9.00  31.11    87
C        32.93  3128.67  31.17  34.00    95
B        35.44  2870.33  34.19  37.00    81
A        41.43  3521.95  37.10  59.00    85

In [ ]:
# Filtering CUSTOMER_LEVEL_BASED and PRICE

In [124]:
agg_df.loc[:, ["CUSTOMERS_LEVEL_BASED", "PRICE", "SEGMENT"]].sample(10)

        CUSTOMERS_LEVEL_BASED  PRICE SEGMENT
328    USA_ANDROID_MALE_41_70  25.67       D
156   USA_ANDROID_FEMALE_0_18  34.62       B
264  DEU_ANDROID_FEMALE_19_23  31.00       D
150    USA_ANDROID_MALE_19_23  34.71       B
207    USA_ANDROID_MALE_41_70  33.00       C
75    FRA_ANDROID_FEMALE_0_18  37.57       A
345  CAN_ANDROID_FEMALE_24_30  19.00       D
51          DEU_IOS_MALE_0_18  39.00       A
344      USA_IOS_FEMALE_24_30  19.00       D
131      BRA_IOS_FEMALE_31_40  35.11       B

In [ ]:
# 5) Classifying new/potential customers and estimating how much income they can bring.

In [ ]:
# Which "Segment" does a "33" year old "Turkish" "Woman" using "Android" fall into and how much income can we expect to earn from her on average?

In [116]:
new_potential_user = "TUR_ANDROID_FEMALE_31_40"

In [ ]:
# Attributes for this user level.

In [137]:
agg_df.loc[agg_df["CUSTOMERS_LEVEL_BASED"] == new_potential_user, :]

   COUNTRY   SOURCE     SEX AGE  PRICE AGE_CAT SEGMENT     CUSTOMERS_LEVEL_BASED
18     tur  android  female  32  43.00   31_40       A  TUR_ANDROID_FEMALE_31_40
35     tur  android  female  31  40.67   31_40       A  TUR_ANDROID_FEMALE_31_40

In [ ]:
# PRICE average for this user level.

In [139]:
agg_df.loc[agg_df["CUSTOMERS_LEVEL_BASED"] == new_potential_user ,:].agg({"PRICE": "mean"})

PRICE    41.83
dtype: float64

In [ ]:
# Which "Segment" does a "29" year old "French" "Man" using "IOS" fall into and how much income can we expect to earn from his on average?

In [142]:
new_potential_user2 = "FRA_IOS_MALE_24_30"

In [ ]:
# Attributes for this user level.

In [143]:
agg_df.loc[agg_df["CUSTOMERS_LEVEL_BASED"] == new_potential_user2, :]

    COUNTRY SOURCE   SEX AGE  PRICE AGE_CAT SEGMENT CUSTOMERS_LEVEL_BASED
169     fra    ios  male  26   34.0   24_30       C    FRA_IOS_MALE_24_30
291     fra    ios  male  27   29.0   24_30       D    FRA_IOS_MALE_24_30

In [ ]:
# PRICE average for this user level.

In [144]:
agg_df.loc[agg_df["CUSTOMERS_LEVEL_BASED"] == new_potential_user2 ,:].agg({"PRICE": "mean"})

PRICE    31.5
dtype: float64